/******************************************************************************/
/* global.c                                                                   */
/*                                                                            */
/* Этот файл содержит описание глобальных переменных ОСРВ.                    */
/*                                                                            */
/* Автор:  Шаргин А. Ю.                                                       */
/*                                                                            */
/* Дата:  20 июля 2000 г.                                                     */
/******************************************************************************/

#include  "sys.h"

/******************************************************************************/
/* Глобальные переменные                                                      */
/******************************************************************************/

/* Текущая задача */
char gRunningTask;

/* Голова списка готовых задач */
char gTaskQueueHead;

/* Массив для хранения задач */
TTaskStruct gTaskQueue[TASK_MAX];

/* Указатель на список свободных структур задач */
char gFreeTask;

/* Базовый адрес стека задач */
unsigned gReturnSP;