/******************************************************************************/
/* hardware.h                                                                 */
/*                                                                            */
/* Этот файл содержит все аппаратно-зависимые макросы, которые используются   */
/* в ОСРВ. Пользователю также рекомендуется использовать их для облегчения    */
/* переносимости приложений на другие платформы.                              */
/*                                                                            */
/* Автор: Шаргин А. Ю.                                                        */
/*                                                                            */
/* Дата создания: 13 июля 2000 г.                                             */
/******************************************************************************/


#ifndef __HARDWARE_H
#define __HARDWARE_H

/******************************************************************************/
/* Макроопределения                                                           */
/******************************************************************************/

/* Запретить прерывания */
#define DI()               asm cli

/* Разрешить прерывания */
#define EI()               asm sti

/* Установить значение указателя стека (SP) */
#define SetSP(expr)        _SP = (expr)

/* Загрузить значение указателя стека (SP) */
#define GetSP()            _SP

/* Объявление прерывания */
#define ISR(IntID)         void interrupt IntID (void)

/******************************************************************************/
/* Определения типов                                                          */
/******************************************************************************/

/* Указатель на обработчик прерывания */
typedef  void  interrupt (*THandler) (void);

#endif
