/******************************************************************************/
/* os.c                                                                       */
/*                                                                            */
/* Этот файл содержит функции, реализующие инициализацию,                     */
/* запуск и останов ОСРВ.                                                     */
/*                                                                            */
/* Автор: Шаргин А. Ю.                                                        */
/*                                                                            */
/* Дата создания: 21 марта 2000 г.                                            */
/******************************************************************************/

#include "rtos_api.h"
#include "sys.h"

/******************************************************************************/
/* Сервисы ОС                                                                 */
/******************************************************************************/

void _Start(_pfn task, char priority)
{
   static int i;

   WfStartOS ();

   /* Инициализируем глобальные переменные. */
   gTaskQueueHead = _NULL;   /* Очередь задач пуста */
   gRunningTask = _NULL;     /* Текущая задача не выбрана */

   /* Создаём очередь свободных структур задач (в неё входят все структуры). */
   gFreeTask = 0;

   for (i=0; i<TASK_MAX-1; i++)
      gTaskQueue[i].link = i+1;

   gTaskQueue[TASK_MAX-1].link = _NULL;

   /* Запоминаем базу стека. */
   gReturnSP = GetSP();

   /* Активизируем задачу. Это приведёт к вызову диспетчера. */
   _Activate(task, priority);
}

void ShutdownOS(void)
{
   /* Выходим по адресу, сохранённому в returnSP. */
   WfShutdownOS ();

   SetSP(gReturnSP);
   return;
}