/******************************************************************************/
/* resource.c                                                                 */
/*                                                                            */
/* Этот файл содержит функции, реализующие подсистему управления ресурсами.   */
/*                                                                            */
/* Автор: Шаргин А. Ю.                                                        */
/*                                                                            */
/* Дата создания: 20 июля 2000 г.                                             */
/******************************************************************************/

#include "rtos_api.h"
#include "sys.h"

/******************************************************************************/
/* Сервисы ОС                                                                 */
/******************************************************************************/

void _Get(TResource prior)
{
   /* Система ChaOS Lite не поддерживает управление ресурсами */
}

void _Release(TResource prior)
{
   /* Система ChaOS Lite не поддерживает управление ресурсами */
}
