/******************************************************************************/
/* sys.h                                                                      */
/*                                                                            */
/* Описания типов, переменных и функций, используемых только внутри ОСРВ.     */
/*                                                                            */
/* Автор:  Шартин А. Ю.                                                       */
/*                                                                            */
/* Дата создания:  20 июля 2000 г.                                            */
/******************************************************************************/

#ifndef __SYS_H
#define __SYS_H

#include "defs.h"
#include "hardware.h"

/******************************************************************************/
/* Константы                                                                  */
/******************************************************************************/

/* "Пустой" индекс */
#define _NULL                 -1

/******************************************************************************/
/* Типы данных                                                                */
/******************************************************************************/

/* Системная структура задачи */
typedef struct tagTTaskStruct
{
   unsigned context;   /* Контекст задачи - адрес в стеке */
   char priority;      /* Текущий приоритет */
   char temp;          /* Вспомогатнльная переменная */
   char link;          /* Индекс следующего элемента в списке задач */
} TTaskStruct;

/******************************************************************************/
/* Декларации функций                                                         */
/******************************************************************************/

/* Планировщик */
void _Schedule(char);

/* Диспетчер */
ISR(_Dispatch);

/******************************************************************************/
/* Глобальные переменные                                                      */
/******************************************************************************/

/* Текущая задача */
extern char gRunningTask;

/* Голова списка готовых задач */
extern char gTaskQueueHead;

/* Массив для хранения задач */
extern TTaskStruct gTaskQueue[TASK_MAX];

/* Указатель на список свободных структур задач */
extern char gFreeTask;

/* Базовый адрес стека задач */
extern unsigned gReturnSP;

#endif